In [1]:
import pandas as pd

In [2]:
import numpy as np

## pandasexcel

In [7]:
data=pd.read_excel("tensor.xlsx")

In [8]:
data

  Unnamed: 0  maas   yas  departman
0       atil  1123  32.0    yazilim
1      ahmet  2342  21.0      satis
2     mehmet  1232  45.0        NaN
3        ali  4566  13.0  pazarlama
4      seyda  3233   NaN     finans
5        nur  1233  34.0      hukuk

In [10]:
doludata=data.dropna()

In [11]:
doludata

  Unnamed: 0  maas   yas  departman
0       atil  1123  32.0    yazilim
1      ahmet  2342  21.0      satis
3        ali  4566  13.0  pazarlama
5        nur  1233  34.0      hukuk

In [12]:
data

  Unnamed: 0  maas   yas  departman
0       atil  1123  32.0    yazilim
1      ahmet  2342  21.0      satis
2     mehmet  1232  45.0        NaN
3        ali  4566  13.0  pazarlama
4      seyda  3233   NaN     finans
5        nur  1233  34.0      hukuk

In [13]:
doludata.to_excel("yenitensor.xlsx")